zh/iptables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh" xml:lang="zh">
<head>
<!-- 2018-03-06 Tue 12:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>iptables</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="iptables - Linux命令">
<meta name="description" content="Autoconf is an extensible package of M4 macros that produce shell scripts to automatically configure software source code packages. These scripts can adapt the packages to many kinds of UNIX-like systems without manual user intervention. Autoconf creates a configuration script for a package from a template file that lists the operating system features that the package can use, in the form of M4 macro calls. ">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="iptables - Linux命令">
<meta property="og:description" content="Autoconf is an extensible package of M4 macros that produce shell scripts to automatically configure software source code packages. These scripts can adapt the packages to many kinds of UNIX-like systems without manual user intervention. Autoconf creates a configuration script for a package from a template file that lists the operating system features that the package can use, in the form of M4 macro calls. ">
<meta name="twitter:title" content="iptables - Linux命令">
<meta name="twitter:description" content="Autoconf is an extensible package of M4 macros that produce shell scripts to automatically configure software source code packages. These scripts can adapt the packages to many kinds of UNIX-like systems without manual user intervention. Autoconf creates a configuration script for a package from a template file that lists the operating system features that the package can use, in the form of M4 macro calls. ">
<link rel="alternate" href="http://linux-command.org/en/iptables.html" hreflang="en" />
<link rel="alternate" href="http://linux-command.org/es/iptables.html" hreflang="es" />
<link rel="alternate" href="http://linux-command.org/ja/iptables.html" hreflang="ja" />
<link rel="alternate" href="http://linux-command.org/ko/iptables.html" hreflang="ko" />
<link rel="alternate" href="http://linux-command.org/zh/iptables.html" hreflang="zh" />
</head>
<body>
<div id="content">
<h1 class="title">iptables</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">摘要</a>
<ul>
<li><a href="#introduction">介绍</a></li>
</ul>
</li>
<li><a href="#how-to-install">如何安装</a>
<ul>
<li><a href="#prerequisites">先决条件</a>
<ul>
<li><a href="#org328e298">from Source code</a></li>
</ul>
</li>
<li><a href="#dependencies">依赖</a></li>
<li><a href="#install">安装</a>
<ul>
<li><a href="#orgfa54928">Ubuntu</a></li>
<li><a href="#org89a2978">CentOS</a></li>
<li><a href="#orgb09bcc9">from Source code</a></li>
</ul>
</li>
<li><a href="#packages">安装的软件包</a></li>
<li><a href="#check">检查</a></li>
</ul>
</li>
<li><a href="#references">参考</a></li>
</ul>
</div>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Version</td>
<td class="org-left"><span class="org-programming-version">1.6.2</span></td>
</tr>

<tr>
<td class="org-left">Package Size</td>
<td class="org-left"><span class="org-programming-size">279KB</span></td>
</tr>

<tr>
<td class="org-left">Installed Size</td>
<td class="org-left"><span class="org-programming-size">1724KB</span></td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<div id="outline-container-org3a16534" class="outline-2">
<h2 id="overview"><a id="org3a16534"></a>摘要</h2>
<div class="outline-text-2" id="text-overview">
</div>

<div id="outline-container-org8dff9c5" class="outline-3">
<h3 id="introduction"><a id="org8dff9c5"></a>介绍</h3>
<div class="outline-text-3" id="text-introduction">
<p>
Autoconf is an extensible package of M4 macros that produce shell scripts to automatically configure software source code packages.
These scripts can adapt the packages to many kinds of UNIX-like systems without manual user intervention.
Autoconf creates a configuration script for a package from a template file that lists the operating system features that the package can use, in the form of M4 macro calls.
</p>
</div>
</div>
</div>

<div id="outline-container-org845959b" class="outline-2">
<h2 id="how-to-install"><a id="org845959b"></a>如何安装</h2>
<div class="outline-text-2" id="text-how-to-install">
</div>

<div id="outline-container-org1ff0c3d" class="outline-3">
<h3 id="prerequisites"><a id="org1ff0c3d"></a>先决条件</h3>
<div class="outline-text-3" id="text-prerequisites">
</div>

<div id="outline-container-org328e298" class="outline-4">
<h4 id="org328e298">from Source code</h4>
<div class="outline-text-4" id="text-org328e298">
<ul class="org-ul">
<li><a href="./git.html">git</a></li>
<li><a href="./autoconf.html">autoconf</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb9da4c8" class="outline-3">
<h3 id="dependencies"><a id="orgb9da4c8"></a>依赖</h3>
<div class="outline-text-3" id="text-dependencies">
<ul class="org-ul">
<li>libc6 : GNU C Library: Shared libraries also a virtual package provided by libc6-udeb
<ul class="org-ul">
<li>[amd64] (&gt;= <span class="org-programming-version">2.14</span>)</li>
<li>[arm64, ppc64el] (&gt;= <span class="org-programming-version">2.17</span>)</li>
<li>[not amd64, arm64, ppc64el] (&gt;= <span class="org-programming-version">>= 2.7</span>)</li>
</ul></li>
<li>libnfnetlink0
<ul class="org-ul">
<li>Netfilter netlink library</li>
</ul></li>
<li>libxtables11 (= <span class="org-programming-version">1.6.0-2ubuntu3</span>)
<ul class="org-ul">
<li>netfilter xtables library</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6b5c9a2" class="outline-3">
<h3 id="install"><a id="org6b5c9a2"></a>安装</h3>
<div class="outline-text-3" id="text-install">
</div>

<div id="outline-container-orgfa54928" class="outline-4">
<h4 id="orgfa54928">Ubuntu</h4>
<div class="outline-text-4" id="text-orgfa54928">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install iptables
</pre>
</div>
</div>
</div>

<div id="outline-container-org89a2978" class="outline-4">
<h4 id="org89a2978">CentOS</h4>
<div class="outline-text-4" id="text-org89a2978">
<div class="org-src-container">
<pre class="src src-sh">$ sudo apt-get install iptables-services
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb09bcc9" class="outline-4">
<h4 id="orgb09bcc9">from Source code</h4>
<div class="outline-text-4" id="text-orgb09bcc9">
<p>
依赖库是必需的。
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git clone git://git.netfilter.org/iptables
$ cd iptables
$ autoreconf -i
$ ./configure
$ make
$ sudo make install
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf4c99c1" class="outline-3">
<h3 id="packages"><a id="orgf4c99c1"></a>安装的软件包</h3>
<div class="outline-text-3" id="text-packages">
<ul class="org-ul">
<li>iptables</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2f3e28" class="outline-3">
<h3 id="check"><a id="orgc2f3e28"></a>检查</h3>
<div class="outline-text-3" id="text-check">
<div class="org-src-container">
<pre class="src src-sh">$ iptables --version
</pre>
</div>

<pre class="example">
iptables v1.6.0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeac6d26" class="outline-2">
<h2 id="references"><a id="orgeac6d26"></a>参考</h2>
<div class="outline-text-2" id="text-references">
<ul class="org-ul">
<li><a href="http://www.netfilter.org/">官方主页</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-03-06 Tue 12:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
